АлогистикТест2/src/Documents/алк_ВозвратОкорки/алк_ВозвратОкорки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВозвратОкорки</name>
  <comment>Удалить</comment>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапасыРасход</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
    <items>
      <name>Карандаши</name>
      <description>Карандаши</description>
    </items>
    <items>
      <name>Кора</name>
      <description>Кора</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Опилки</name>
      <description>Опилки</description>
    </items>
    <items>
      <name>ОтходыПилмат</name>
      <description>Отходы производства пиломатериалов</description>
    </items>
    <items>
      <name>Пиловочник</name>
      <description>Пиловочник</description>
    </items>
    <items>
      <name>Пиломатериал</name>
      <description>Пиломатериал</description>
    </items>
    <items>
      <name>ПиломатериалСП</name>
      <description>Пиломатериал (СП)</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
    <items>
      <name>ШпонКусковой</name>
      <description>Шпон кусковой</description>
    </items>
    <items>
      <name>Щепа</name>
      <description>Щепа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ВозвратОкорки/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить(РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Окорка));
	
	Элементы.ЗапасыНоменклатура.СписокВыбора.ЗагрузитьЗначения(МассивЗначений);
	
	Объект.СтруктурнаяЕдиница = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ);
	
	Пиловочник = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Пиловочник);
	БиржаЦЛП = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ);
	
	УчастокПриИзмененииНаСервере();	
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыРасходХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗапасыРасход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыРасходКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗапасыРасход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

#КонецОбласти


Процедура Конец()
	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры
